  &НаКлиенте
  Процедура СоставКоличествоПриИзменении(Элемент) Экспорт
	  Строка = Элементы.Состав.ТекущиеДанные;
	  Строка.Сумма = Строка.Количество * Строка.Цена;
	  ОбновитьОбщуюСумму();
КонецПроцедуры

&НаКлиенте
Процедура СоставЦенаПриИзменении(Элемент) Экспорт
    Строка = Элементы.Состав.ТекущиеДанные;
	Строка.Сумма = Строка.Количество * Строка.Цена;
	ОбновитьОбщуюСумму();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОбщуюСумму()
    ОбщаяСумма = 0;
	Для Каждого Строка Из Объект.Состав Цикл
        ОбщаяСумма = ОбщаяСумма + Строка.Сумма;
    КонецЦикла;
    Объект.СуммаЗаказа = ОбщаяСумма; // Обновление значения на форме
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ)

    // Подсчет суммы
    ОбщаяСумма = 0;
    Для Каждого Строка Из Объект.Состав Цикл
        Строка.Сумма = Строка.Количество * Строка.Цена;
        ОбщаяСумма = ОбщаяСумма + Строка.Сумма;
    КонецЦикла;
    Объект.СуммаЗаказа = ОбщаяСумма;

    // Движения по регистру ИсторияЗаказов
    НаборЗаписей = РегистрыНакопления.ИсторияЗаказов.СоздатьНаборЗаписей();
    
    Запись = НаборЗаписей.Добавить();
    Запись.Период = Объект.Дата;                // Дата заказа
    Запись.Заказ = Объект.Ссылка;               // Ссылка на документ
    Запись.Курьер = Объект.Курьер;              // Курьер
    Запись.Сумма = Объект.СуммаЗаказа;          // Подсчитанная сумма
    Запись.КоличествоБлюд = Объект.Состав.Количество();  // Кол-во строк в табл. части

    НаборЗаписей.Записать();

КонецПроцедуры


