
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ИсторияЗаказов 
	Движения.ИсторияЗаказов.Записывать = Истина;
	Для Каждого ТекСтрокаСостав Из Состав Цикл
		Движение = Движения.ИсторияЗаказов.Добавить();
		Движение.Период = Дата;
		Движение.Заказ = Номер;
		Движение.Дата = Дата;
		Движение.Курьер = Курьер;
		Движение.Сумма = СуммаЗаказа;
		Движение.КоличествоБлюд = ТекСтрокаСостав.Количество;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
